zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/at.h
#define AT_anti_tamper__LEVELD_LEVEL24_Pos    _UINT32_(0)                                          /* (AT_anti_tamper__LEVELD) Level 24. Position */
#define AT_anti_tamper__LEVELD_LEVEL24_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL24_Pos) /* (AT_anti_tamper__LEVELD) Level 24. Mask */
#define AT_anti_tamper__LEVELD_LEVEL24(value) (AT_anti_tamper__LEVELD_LEVEL24_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL24_Pos)) /* Assignment of value for LEVEL24 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL25_Pos    _UINT32_(4)                                          /* (AT_anti_tamper__LEVELD) Level 25. Position */
#define AT_anti_tamper__LEVELD_LEVEL25_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL25_Pos) /* (AT_anti_tamper__LEVELD) Level 25. Mask */
#define AT_anti_tamper__LEVELD_LEVEL25(value) (AT_anti_tamper__LEVELD_LEVEL25_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL25_Pos)) /* Assignment of value for LEVEL25 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL26_Pos    _UINT32_(8)                                          /* (AT_anti_tamper__LEVELD) Level 26. Position */
#define AT_anti_tamper__LEVELD_LEVEL26_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL26_Pos) /* (AT_anti_tamper__LEVELD) Level 26. Mask */
#define AT_anti_tamper__LEVELD_LEVEL26(value) (AT_anti_tamper__LEVELD_LEVEL26_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL26_Pos)) /* Assignment of value for LEVEL26 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL27_Pos    _UINT32_(12)                                         /* (AT_anti_tamper__LEVELD) Level 27. Position */
#define AT_anti_tamper__LEVELD_LEVEL27_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL27_Pos) /* (AT_anti_tamper__LEVELD) Level 27. Mask */
#define AT_anti_tamper__LEVELD_LEVEL27(value) (AT_anti_tamper__LEVELD_LEVEL27_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL27_Pos)) /* Assignment of value for LEVEL27 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL28_Pos    _UINT32_(16)                                         /* (AT_anti_tamper__LEVELD) Level 28. Position */
#define AT_anti_tamper__LEVELD_LEVEL28_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL28_Pos) /* (AT_anti_tamper__LEVELD) Level 28. Mask */
#define AT_anti_tamper__LEVELD_LEVEL28(value) (AT_anti_tamper__LEVELD_LEVEL28_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL28_Pos)) /* Assignment of value for LEVEL28 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL29_Pos    _UINT32_(20)                                         /* (AT_anti_tamper__LEVELD) Level 29. Position */
#define AT_anti_tamper__LEVELD_LEVEL29_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL29_Pos) /* (AT_anti_tamper__LEVELD) Level 29. Mask */
#define AT_anti_tamper__LEVELD_LEVEL29(value) (AT_anti_tamper__LEVELD_LEVEL29_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL29_Pos)) /* Assignment of value for LEVEL29 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL30_Pos    _UINT32_(24)                                         /* (AT_anti_tamper__LEVELD) Level 30. Position */
#define AT_anti_tamper__LEVELD_LEVEL30_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL30_Pos) /* (AT_anti_tamper__LEVELD) Level 30. Mask */
#define AT_anti_tamper__LEVELD_LEVEL30(value) (AT_anti_tamper__LEVELD_LEVEL30_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL30_Pos)) /* Assignment of value for LEVEL30 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_LEVEL31_Pos    _UINT32_(28)                                         /* (AT_anti_tamper__LEVELD) Level 31. Position */
#define AT_anti_tamper__LEVELD_LEVEL31_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELD_LEVEL31_Pos) /* (AT_anti_tamper__LEVELD) Level 31. Mask */
#define AT_anti_tamper__LEVELD_LEVEL31(value) (AT_anti_tamper__LEVELD_LEVEL31_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELD_LEVEL31_Pos)) /* Assignment of value for LEVEL31 in the AT_anti_tamper__LEVELD register */
#define AT_anti_tamper__LEVELD_Msk            _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__LEVELD) Register Mask  */


/* -------- AT_anti_tamper__SETLEVEL : (AT Offset: 0x210) ( /W 32) Set tamper level. -------- */
#define AT_anti_tamper__SETLEVEL_RESETVALUE   _UINT32_(0x00)                                       /*  (AT_anti_tamper__SETLEVEL) Set tamper level.  Reset Value */

#define AT_anti_tamper__SETLEVEL_LEVEL_Pos    _UINT32_(0)                                          /* (AT_anti_tamper__SETLEVEL) Tamper level. Position */
#define AT_anti_tamper__SETLEVEL_LEVEL_Msk    (_UINT32_(0x7) << AT_anti_tamper__SETLEVEL_LEVEL_Pos) /* (AT_anti_tamper__SETLEVEL) Tamper level. Mask */
#define AT_anti_tamper__SETLEVEL_LEVEL(value) (AT_anti_tamper__SETLEVEL_LEVEL_Msk & (_UINT32_(value) << AT_anti_tamper__SETLEVEL_LEVEL_Pos)) /* Assignment of value for LEVEL in the AT_anti_tamper__SETLEVEL register */
#define AT_anti_tamper__SETLEVEL_ID_Pos       _UINT32_(8)                                          /* (AT_anti_tamper__SETLEVEL) Tamper ID. Position */
#define AT_anti_tamper__SETLEVEL_ID_Msk       (_UINT32_(0x1F) << AT_anti_tamper__SETLEVEL_ID_Pos)  /* (AT_anti_tamper__SETLEVEL) Tamper ID. Mask */
#define AT_anti_tamper__SETLEVEL_ID(value)    (AT_anti_tamper__SETLEVEL_ID_Msk & (_UINT32_(value) << AT_anti_tamper__SETLEVEL_ID_Pos)) /* Assignment of value for ID in the AT_anti_tamper__SETLEVEL register */
#define AT_anti_tamper__SETLEVEL_PROTKEY_Pos  _UINT32_(16)                                         /* (AT_anti_tamper__SETLEVEL) Protection key (0xA84C). Position */
#define AT_anti_tamper__SETLEVEL_PROTKEY_Msk  (_UINT32_(0xFFFF) << AT_anti_tamper__SETLEVEL_PROTKEY_Pos) /* (AT_anti_tamper__SETLEVEL) Protection key (0xA84C). Mask */
#define AT_anti_tamper__SETLEVEL_PROTKEY(value) (AT_anti_tamper__SETLEVEL_PROTKEY_Msk & (_UINT32_(value) << AT_anti_tamper__SETLEVEL_PROTKEY_Pos)) /* Assignment of value for PROTKEY in the AT_anti_tamper__SETLEVEL register */
#define AT_anti_tamper__SETLEVEL_Msk          _UINT32_(0xFFFF1F07)                                 /* (AT_anti_tamper__SETLEVEL) Register Mask  */


/* -------- AT_anti_tamper__FILTERCFG : (AT Offset: 0x214) (R/W 32) Filter configuration (threshold, period). -------- */
#define AT_anti_tamper__FILTERCFG_RESETVALUE  _UINT32_(0x00)                                       /*  (AT_anti_tamper__FILTERCFG) Filter configuration (threshold, period).  Reset Value */

