zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/at.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* AT register API structure */
typedef struct
{  /* Anti-Tamper Controller (AT) */
  __IO  uint32_t                       AT_CTRLA;           /* Offset: 0x00 (R/W  32) Control Register A */
  __I   uint8_t                        Reserved1[0xFC];
  __IO  uint32_t                       AT_TAMPER_KEY[16];  /* Offset: 0x100 (R/W  32) Tamper Key n Register */
  __I   uint8_t                        Reserved2[0xC0];
  __I   uint32_t                       AT_anti_tamper__LEVELA; /* Offset: 0x200 (R/   32) Tamper levels 0 to 7. */
  __I   uint32_t                       AT_anti_tamper__LEVELB; /* Offset: 0x204 (R/   32) Tamper levels 8 to 15. */
  __I   uint32_t                       AT_anti_tamper__LEVELC; /* Offset: 0x208 (R/   32) Tamper levels 16 to 23. */
  __I   uint32_t                       AT_anti_tamper__LEVELD; /* Offset: 0x20C (R/   32) Tamper levels 24 to 31. */
  __O   uint32_t                       AT_anti_tamper__SETLEVEL; /* Offset: 0x210 ( /W  32) Set tamper level. */
  __IO  uint32_t                       AT_anti_tamper__FILTERCFG; /* Offset: 0x214 (R/W  32) Filter configuration (threshold, period). */
  __IO  uint32_t                       AT_anti_tamper__SOFTTAMP; /* Offset: 0x218 (R/W  32) Software triggered tamper. */
  __I   uint32_t                       AT_anti_tamper__RAWSTAT; /* Offset: 0x21C (R/   32) Raw status. */
  __IO  uint32_t                       AT_anti_tamper__STAT; /* Offset: 0x220 (R/W  32) Status (write to clear). */
  __I   uint32_t                       AT_anti_tamper__TIMESTAMP; /* Offset: 0x224 (R/   32) Timestamp for the last tamper. */
  __I   uint32_t                       AT_anti_tamper__FILTERCNT; /* Offset: 0x228 (R/   32) Current value of filter counter. */
  __IO  uint32_t                       AT_anti_tamper__SOFTINFO; /* Offset: 0x22C (R/W  32) Register for software purpose only. */
  __IO  uint32_t                       AT_anti_tamper__TAMPERFLAG; /* Offset: 0x230 (R/W  32) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output. */
  __I   uint32_t                       AT_anti_tamper__SOFTRESET; /* Offset: 0x234 (R/   32) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above. */
} at_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_AT_COMPONENT_H_ */
